tap "beeftornado/rmtree"
tap "delphinus/sfmono-square"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "nodenv/nodenv"
tap "railwaycat/emacsmacport"
brew "glib"
brew "adwaita-icon-theme"
brew "openssl@3"
brew "bat"
brew "btop"
brew "difftastic"
brew "direnv"
brew "gmp"
brew "emacs"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "isl"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "readline"
brew "go"
brew "graphviz"
brew "gtk+3"
brew "imagemagick"
brew "jq"
brew "libyaml"
brew "lsd"
brew "openjdk"
brew "peco"
brew "pkgconf"
brew "plantuml"
brew "poppler"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "sevenzip"
brew "tig"
brew "volta"
brew "xh"
brew "yazi"
brew "yq"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
cask "alacritty"
cask "alt-tab"
cask "battery"
cask "clipy"
cask "coteditor"
cask "dotnet-sdk"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-symbols-only-nerd-font"
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "linearmouse"
cask "middleclick"
cask "mysqlworkbench"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "warp"
cask "wave"
vscode "aaronduino.chisel"
vscode "adrianwilczynski.asp-net-core-switcher"
vscode "aki77.html-erb"
vscode "aki77.quick-open-rails"
vscode "aki77.rails-db-schema"
vscode "aki77.rails-i18n"
vscode "aki77.rails-partial"
vscode "aki77.rails-routes"
vscode "alefragnani.bookmarks"
vscode "aliariff.slim-lint"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bmpenuelas.waveform-render"
vscode "borama.ruby-slim"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codezombiech.gitignore"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "cschlosser.doxdocgen"
vscode "csholmq.excel-to-markdown-table"
vscode "dan-c-underwood.arm"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "eservice-online.vs-sharper"
vscode "fabiospampinato.vscode-diff"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jemmyw.rails-fast-nav"
vscode "jrebocho.vscode-random"
vscode "kevin-chatham.aspnetcorerazor-html-css-class-completion"
vscode "koichisasada.vscode-rdbg"
vscode "kreativ-software.csharpextensions"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "leonardssh.vscord"
vscode "mame.ruby-typeprof"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.blazorwasm-companion"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "msjsdiag.vscode-react-native"
vscode "mushan.vscode-paste-image"
vscode "natizyskunk.sftp"
vscode "naumovs.color-highlight"
vscode "ngouy.vscode-gemfile-infos"
vscode "nhoizey.gremlins"
vscode "ninoseki.vscode-mogami"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "nopeslide.vscode-drawio-plugin-rtl"
vscode "nopeslide.vscode-drawio-plugin-wavedrom"
vscode "oderwat.indent-rainbow"
vscode "patcx.vscode-nuget-gallery"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "prabhakar.copy"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "ryuta46.multi-command"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sevenc-nanashi.gemfile-lock-highlight"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "soutaro.steep-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "takumii.markdown-previewstyle"
vscode "takumii.markdown-toc-num"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tavo.rails-schema"
vscode "tintoy.msbuild-project-tools"
vscode "tobias-sekan.solutionextension"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.vscode-input-sequence"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "unoplatform.vscode"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "willasm.rc-script"
vscode "xdebug.php-debug"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
