adwaita-icon-theme
aom
at-spi2-core
autoconf
bat
brotli
ca-certificates
cairo
dbus
difftastic
emacs
eza
fd
fontconfig
freetype
fribidi
fzf
gcc
gd
gdk-pixbuf
gettext
gh
giflib
git
git-delta
glib
gmp
gnutls
go
graphite2
graphviz
gsettings-desktop-schemas
gtk+3
gts
harfbuzz
hicolor-icon-theme
highway
icu4c@76
imath
isl
jansson
jasper
jpeg-turbo
jpeg-xl
jq
libavif
libdeflate
libepoxy
libevent
libgit2
libidn2
libmpc
libnghttp2
libpng
librsvg
libssh2
libtasn1
libtiff
libtool
libunistring
libvmaf
libx11
libxau
libxcb
libxdmcp
libxext
libxfixes
libxi
libxrender
libxtst
libyaml
little-cms2
lsd
lz4
lzo
m4
mpdecimal
mpfr
ncurses
netpbm
nettle
oniguruma
openexr
openjdk
openssl@3
p11-kit
pango
pcre2
peco
pixman
pkgconf
plantuml
python-packaging
python@3.12
python@3.13
rbenv
readline
ripgrep
ruby-build
sqlite
tig
tree-sitter
unbound
volta
webp
xh
xorgproto
xz
zstd
jesseduffield/lazydocker/lazydocker
jesseduffield/lazygit/lazygit
alacritty
alt-tab
clipy
coteditor
dotnet-sdk
font-hackgen
font-hackgen-nerd
font-plemol-jp
font-plemol-jp-hs
font-plemol-jp-nf
font-udev-gothic
font-udev-gothic-nf
iterm2
jordanbaird-ice
linearmouse
middleclick
mysqlworkbench
rectangle
sequel-ace
warp
wave
