adwaita-icon-theme
aom
at-spi2-core
atk
bat
bdw-gc
brotli
ca-certificates
cairo
dbus
emacs
eza
fd
fontconfig
fontforge
freetype
fribidi
gcc
gd
gdbm
gdk-pixbuf
gettext
giflib
git
glib
gmp
gnutls
go
gobject-introspection
graphite2
graphviz
gsettings-desktop-schemas
gtk+3
gts
guile
harfbuzz
hicolor-icon-theme
highway
icu4c
imath
isl
jansson
jasper
jpeg
jpeg-turbo
jpeg-xl
jq
krb5
libavif
libepoxy
libevent
libffi
libgit2
libidn2
libmpc
libnghttp2
libpng
libpthread-stubs
librsvg
libspiro
libssh2
libtasn1
libtiff
libtool
libuninameslist
libunistring
libvmaf
libx11
libxau
libxcb
libxdmcp
libxext
libxfixes
libxi
libxrender
libxtst
little-cms2
lsd
lz4
lzo
m4
mpdecimal
mpfr
netpbm
nettle
oniguruma
openexr
openjdk
openssl@1.1
openssl@3
p11-kit
pango
pcre
pcre2
peco
pixman
pkg-config
plantuml
python@3.10
python@3.11
python@3.9
readline
ripgrep
sqlite
tree-sitter
unbound
volta
webp
woff2
xorgproto
xz
zstd
dotnet-sdk
font-hackgen
font-hackgen-nerd
font-udev-gothic
font-udev-gothic-nf
