7zip
bat
dark
dotnet-sdk
eza
gcc
gdb
git
go
gow
innounp
llvm
lsd
oh-my-posh
openjdk
openssl
peco
posh-git
python
scoop-completion
sourcetrail
sqlitebrowser
sudo
terminal-icons
volta
